routes_and_controllers/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Bold and Brash"], ["image_url", "flickr.com/6"], ["artist_id", 8], ["created_at", "2022-03-09 20:37:28.290548"], ["updated_at", "2022-03-09 20:37:28.290548"]]
---
  def create
    @artwork = Artwork.new(artwork_params)

    if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Belongs in the Trash"], ["updated_at", "2022-03-09 20:38:01.178356"], ["id", 8]]
---
  def update
    @artwork = Artwork.find(params[:id])

    if @artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 8]]
---
  def destroy
    @artwork = Artwork.find(params[:id])

    @artwork.destroy