routes_and_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 6], ["viewer_id", 12], ["created_at", "2022-03-09 21:24:26.104101"], ["updated_at", "2022-03-09 21:24:26.104101"]]
---
  def create
    @artwork_share = ArtworkShare.new(artwork_share_params)

    if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 17]]
---
  def destroy
    @artwork_share = ArtworkShare.find(params[:id])
    @artwork_share.destroy