routes_and_controllers/app/controllers/comments_controller.rb

  def index
    if params[:user_id]
      @comment = Comment.where(user_id: params[:user_id])
      render json: @comment
    elsif params[:artwork_id]
      @comment = Comment.where(artwork_id: params[:artwork_id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 12]]

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "I don't know what I'm looking at"], ["user_id", 18], ["artwork_id", 12], ["created_at", "2022-03-10 15:54:24.087622"], ["updated_at", "2022-03-10 15:54:24.087622"]]