routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username ILIKE 'steve')
SELECT "users".* FROM "users"
---
  def index
    if params[:username]
      @user = User.where('username ILIKE ?', params[:username])
      render json: @user
    else
      render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Kevin2"], ["email", "Kevin@hotmail.com"], ["updated_at", "2022-03-09 19:09:06.335417"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)